app/controllers/brands_controller.rb

SELECT "brands".* FROM "brands"
---
  def index
    @brands = Brand.all