app/controllers/colors_controller.rb

  def index
    @colors = Color.all
---
SELECT "colors".* FROM "colors"