app/controllers/orders_controller.rb

  def index
    if current_user.is_admin?
      @orders = Order.all
    else
      @orders = Order.where(user_id: current_user.id)
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 1]]