app/controllers/products_controller.rb

  def index
    @products = Product.where("stock > :minimun_stock", {minimun_stock: 0})
    @brands = Brand.all
---
SELECT "products".* FROM "products" WHERE (stock > 0)
SELECT "brands".* FROM "brands"