app/controllers/storages_controller.rb

SELECT "storages".* FROM "storages"
---
  def index
    @storages = Storage.all